src/cf/src/Documents/ПредложениеПоставщика/ПредложениеПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПредложениеПоставщика</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредложения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Победитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставкиДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ПредложениеПоставщика/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "ЗапросЦен";
	Команда.Представление = НСтр("ru = 'Запрос цен'; fr = 'Demande de prix';
		|en = 'Request for prices'; es = 'Solicitud de precios'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗапросЦен") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			Документы.РеализацияТоваровУслуг.PrintDevisA4(Док, Таб, "Demande de prix");
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "ЗапросЦен",
			НСтр("ru = 'Запрос цен'; fr = 'Demande de prix';
			|en = 'Request for prices'; es = 'Solicitud de precios'"),
			Таб, "Документ.РеализацияТоваровУслуг.DevisBL_A4");
	КонецЕсли;

КонецПроцедуры

// Возвращает предложения поставщиков по заказу покупателя, отсортированные по сумме в основной валюте
// (лучшее - наименьшая сумма - первым): предложения могут быть в разных валютах.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ, по которому идёт тендер.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Ссылка, Поставщик, Сумма (в валюте предложения), Валюта, СуммаРегл (в основной
//                    валюте), СрокПоставкиДней, Победитель.
//
Функция ПредложенияЗаказа(Заказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Предложения.Ссылка КАК Ссылка,
	|	Предложения.Поставщик КАК Поставщик,
	|	Предложения.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Предложения.ВВалюте
	|			ТОГДА Предложения.Валюта
	|		ИНАЧЕ &ОсновнаяВалюта
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА Предложения.ВВалюте
	|			ТОГДА Предложения.СуммаРегл
	|		ИНАЧЕ Предложения.Сумма
	|	КОНЕЦ КАК СуммаРегл,
	|	Предложения.СрокПоставкиДней КАК СрокПоставкиДней,
	|	Предложения.Победитель КАК Победитель
	|ИЗ
	|	Документ.ПредложениеПоставщика КАК Предложения
	|ГДЕ
	|	Предложения.ЗаказПокупателя = &Заказ
	|	И НЕ Предложения.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаРегл";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ОсновнаяВалюта", РаботаСВалютами.ОсновнаяВалюта());
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Делает предложение победителем тендера: у остальных предложений того же заказа покупателя
// флаг победителя снимается, у выбранного - устанавливается. Изменения пишутся в одной транзакции.
//
// Параметры:
//  Предложение - ДокументСсылка.ПредложениеПоставщика - выбранное предложение.
//
Процедура ВыбратьПобедителя(Предложение) Экспорт
	Заказ = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Предложение), "ЗаказПокупателя").Получить(Предложение).ЗаказПокупателя;
	ТЗПредложения = ПредложенияЗаказа(Заказ);
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.ПредложениеПоставщика");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		Для Каждого Стр Из ТЗПредложения Цикл
			ЭтоПобедитель = Стр.Ссылка = Предложение;
			Если Стр.Победитель = ЭтоПобедитель Тогда
				Продолжить;
			КонецЕсли;
			ДокОбъект = Стр.Ссылка.ПолучитьОбъект();
			ДокОбъект.Победитель = ЭтоПобедитель;
			ДокОбъект.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
